[M_Ep7_ATrainToCatch MissionDefinition]
MissionDescription="You've rescued Roland from Hyperion -- now it's time for the customary ''thanks for rescuing me from those bad guys; now, let's talk about how we're going to put a bullet in Jack's face'' conversation back in [place]Sanctuary[-place]."

[M_Ep7_ATrainToCatch:DefeatBotBossSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend, Mordecai, has informed you that the Vault Key is being transported through the [place]Tundra Express[-place] on a Hyperion train. Roland has suggested you hijack the train and steal it. Instead of finding the Vault Key, however, you found a badass Hyperion soldier named Wilhelm. You'll have to kill him."

[M_Ep7_ATrainToCatch:GetBackToSanctuarySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend, Mordecai, has informed you that the Vault Key is being transported through the [place]Tundra Express[-place] on a Hyperion train. Roland has suggested you hijack the train and steal it. Instead of finding the Vault Key, however, you found a badass Hyperion soldier named Wilhelm and killed him. Still, there's a silver lining; he was carrying a unique power core that, if installed into Sanctuary's shields, would keep them running forever."

[M_Ep7_ATrainToCatch:GetTinaExplosivesSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend, Mordecai, has informed you that the Vault Key is being transported through the [place]Tundra Express[-place] on a Hyperion train. Roland has suggested you hijack the train and steal it. Roland also recommends that you meet up with an explosives expert named Tina. Which you did. Roland also warned you that Tina might be a bit insane. Which she is To hijack the train, Tina says you'll need to get some ''badonkadonks'' for her ''damsels.'' How that has anything to do with hijacking a train is anyone's guess."

[M_Ep7_ATrainToCatch:GoToTundraExpressSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Hyperion wants to use the Vault Key to awaken an alien Warrior and wipe out everyone on Pandora. If you can steal the Vault Key, however, Hyperion's plans will be ruined. Roland has a man spying on Hyperion who lives out in [place]Tundra Express[-place]. If you can reach him, he should be able to tell you where the Vault key is."

[M_Ep7_ATrainToCatch:GoToWreckageSiteSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend, Mordecai, has informed you that the Vault Key is being transported through the [place]Tundra Express[-place] on a Hyperion train. You just hijacked the train -- now, you just have to search the wreckage and find the Vault Key."

[M_Ep7_ATrainToCatch:IncinerateVarkidSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Hyperion wants to use the Vault Key to awaken an alien Warrior and wipe out everyone on Pandora. If you can steal the Vault Key, however, Hyperion's plans will be ruined. Roland has a man spying on Hyperion who lives out in [place]Tundra Express[-place]. If you can reach him, he should be able to tell you where the Vault key is. Unfortunately, Roland's contact is hungover. You'll have to set some varkids on fire so their screeches will wake him up."

[M_Ep7_ATrainToCatch:IncinerateVarkidsWeaponCheckSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Hyperion wants to use the Vault Key to awaken an alien Warrior and wipe out everyone on Pandora. If you can steal the Vault Key, however, Hyperion's plans will be ruined. Roland has a man spying on Hyperion who lives out in [place]Tundra Express[-place]. If you can reach him, he should be able to tell you where the Vault key is. Unfortunately, Roland's contact is hungover. You'll have to set some varkids on fire so their screeches will wake him up."

[M_Ep7_ATrainToCatch:MeetTinyTinaSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Hyperion wants to use the Vault Key to awaken an alien Warrior and wipe out everyone on Pandora. If you can steal the Vault Key, however, Hyperion's plans will be ruined. Roland's spy, an ex-Vault Hunter named Mordecai, informed you that the key is being held on a train that runs through [place]Tundra Express[-place] You'll need some help to hijack it, though. Roland has suggested you meet up with Tina, a bombmaker and an old friend of Roland's."

[M_Ep7_ATrainToCatch:MeetTinyTinaTitleCardSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Hyperion wants to use the Vault Key to awaken an alien Warrior and wipe out everyone on Pandora. If you can steal the Vault Key, however, Hyperion's plans will be ruined. Roland's spy, an ex-Vault Hunter named Mordecai, informed you that the key is being held on a train that runs through [place]Tundra Express[-place] You'll need some help to hijack it, though. Roland has suggested you meet up with Tina, a bombmaker and an old friend of Roland's."

[M_Ep7_ATrainToCatch:PickupPowercoreSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend, Mordecai, has informed youthat the Vault Key is being transported through the [place]Tundra Express[-place] on a Hyperion train. Roland has suggested you hijack the train and steal it Instead of finding the Vault Key, however, you found a badass Hyperion soldier named Wilhelm and killed him. Still, there's a silver lining; he was carrying a unique power core that, if installed into Sanctuary's shields, would keep them running forever. "

[M_Ep7_ATrainToCatch:ReturntoTinaSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend, Mordecai, has informed you that the Vault Key is being transported through the [place]Tundra Express[-place] on a Hyperion train. Roland has suggested you hijack the train and steal it Roland also recommends that you meet up with an explosives expert named Tina. Which you did. Roland also warned you that Tina might be a bit insane. Which she was. To hijack the train, Tina says you'll need to get some ''badonkadonks'' for her ''damsels.'' How that has anything to do with hijacking a train is anyone's guess After you collected the ''badonkadonks'' (which turned out to be high explosives), Tina requested your presence back at her hut. "

[M_Ep7_ATrainToCatch:TakeDollExplosivesSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland's friend, Mordecai, has informed youthat the Vault Key is being transported through the [place]Tundra Express[-place] on a Hyperion train. Roland has suggested you hijack the train and steal it. Roland recommended you meet up with an explosives expert named Tina. Which you did. Roland also warned you that Tina might be a bit insane. Which she was. She also appears to be disturbingly talented at creating explosives, however, because she's just combined the explosives you collected with her stuffed animals to create what appear to be homing rockets. Tina has given you permission to use these ''damsels'' to destroy the train tracks and raid the Hyperion train."
